message_1 = f"""Здравствуйте!

Недавно вы проявили интерес к нашей игре Cashflow, и я хотела узнать, остались ли у вас вопросы или нужна дополнительная информация для того, чтобы записаться
Я уверена, что участие в игре поможет вам лучше понять, как управлять финансами и инвестировать с умом.

Напомню, что у нас есть несколько удобных временных слотов на выбор:

    Среда в 11:00
    Четверг в 19:00
    Суббота в 11:00

Если вы еще раздумываете, не стесняйтесь задать вопросы – я с удовольствием помогу вам сделать выбор!
Буду рада видеть вас среди наших участников"""


message_2 = f"""Здравствуйте. Вы интересовались игрой Cashflow, но к сожалению так и пришли

Если у вас в жизни застой? вы хотите улучшить семейные отношения или найти вторую половинку?
Вам не хватает денег и вы хотите вырасти в доходе? В вашей жизни много стресса и это негативно влияет на ваше здоровье?

Приходите на игру Кэшфлоу, потому что эта игра не только про финансы. Эта игра меняет мышление
Игроки, которые прошли нашу игру отмечают, что после игры в их жизни произошли преображения:

- начальник повысил зарплату
- муж стал внимательнее отноститься и дарить цветы
- жена стала ценить мужа
- стало больше энергии
- появилось время на важные дела
- появилось новое интересное окружение
- наконец-то поехали с семьей в отпуск
- совершили долгожданную покупку машины

Хотите также? Записывайтесь на игру. У нас есть несколько удобных временных слотов на выбор:

    Среда в 11:00
    Четверг в 19:00
    Суббота в 11:00
    
Не стесняйтесь задать вопросы – я с удовольствием помогу вам сделать выбор! Буду рада видеть вас среди наших участников"""

u_message_3 = f"""[Имя], спасибо, что были на нашей игре Cashflow!
🎉 Надеюсь, вам понравилось и вы получили ценные знания и навыки, которые пригодятся в реальной жизни.

Нам очень важно ваше мнение, чтобы мы могли сделать наши игры еще лучше и интереснее для всех участников. Буду очень признательна, если вы сможете уделить пару минут и заполнить короткую анкету обратной связи.
Вот ссылка на анкету: https://forms.gle/JCLtiTHxsNyPHB9TA
Ваши отзывы помогают нам расти и развиваться. Благодарю за ваше время и вклад в улучшение наших игр!
Если у вас остались какие-то вопросы или предложения, не стесняйтесь связаться со мной. Буду рада помочь!

С уважением, Ольга и клуб ProDvigenie"""

#номера из группы Ерлана

msg_tournament = f"""Здравствуйте. Приглашаю вас на турнир по Cashflow!
Турнир пройдет в три этапа. Три игры, которые определят самых сильных игроков. В первом туре сразятся 70 участников и до финала дойдут только 7 человек!
Каждый этап – это возможность не только проявить свои способности, но и научиться новому, обменяться опытом с другими участниками.
Вы можете принять участие как индивидуально, так и в составе команды.
Дата турнира: 15 сентября. Прием заявок открыт до 1 сентября.
Это будет грандиозное событие, и я уверена, что вам оно точно понравится! Готовы присоединиться?
Напишите "Турнир" в ответ и я отправлю вам анкету участника и положение по турниру"""

msg_t1 = f"""Сообщение для проверки работы скрипта
версия 0.12
отладка 7"""

msg_t2 = f"""Здравствуйте. Приглашаю на турнир по Cashflow!
70 участников и финал для 7 лучших.
Участвуйте, учитесь новому и обменивайтесь опытом.
Турнир 15 сентября, регистрация до 1 сентября.
Напишите "Турнир", чтобы получить анкету и все подробности!"""

nbg = f"""Здравствуйте.
Напоминаю, что завтра в 11:00 мы встречаемся на игре Cashflow
Место проведения: Теплица (Курмангазы 25)
https://2gis.kz/almaty/geo/9429940001141548

‼Прошу не опаздывать, иначе рискуете пропустить что-то важное"""

ColdBaseMsg = [
f"""Привет! 👋 Вы пропустили несколько ярких игр CashFlow, но у вас есть шанс присоединиться!
🎉 У нас всегда крутая атмосфера, новые знакомства и море инсайтов по финансам. Готовы попробовать?

Смотрите как классно проходят наши игры https://www.instagram.com/p/C3VPj5HiHpG
Если ссылка неактивна, отправьте любое сообщение в ответ""",

f"""Привет! 👋 У нас невероятная атмосфера на играх Cashflow, новые друзья и полезные знания по финансам. Присоединяйтесь к следующей игре — вам точно понравится! 🔥

Смотрите как классно проходят наши игры https://www.instagram.com/p/C3VPj5HiHpG
Если ссылка неактивна, отправьте любой смайлик в ответ""",

f"""😊 Вы так и не смогли заглянуть на CashFlow?
А у нас здесь весело и полезно: прокачиваем финансы, обмениваемся инсайтами и наслаждаемся игрой. Приходите, будет интересно! 🎲

Смотрите как классно проходят наши игры https://www.instagram.com/p/C3VPj5HiHpG
Если ссылка неактивна, отправьте любой смайлик в ответ""",

f"""Привет! 🌟 На наших играх CashFlow столько энергии и вдохновения! Здесь вы найдете и новые знания, и классных людей
Приходите к нам, чтобы вместе расти и развиваться! 💪

Смотрите как классно проходят наши игры https://www.instagram.com/p/C3VPj5HiHpG
Если ссылка неактивна, отправьте любое сообщение в ответ"""
]

afterGame = f"""Здравствуйте! 👋

Спасибо, что присоединились к нашей игре CashFlow! Надеюсь, вам понравился процесс и вы получили заряд вдохновения и полезный опыт.

Нам очень важно узнать ваши впечатления — это помогает сделать наши игры еще лучше! Пожалуйста, поделитесь своим мнением в короткой анкете: https://forms.gle/aiBBjCHfd3r6YxhP8.

Кроме того, приглашаю вас в наш Telegram-канал, где публикуем анонсы игр, делимся интересными материалами и полезными советами: https://t.me/+sCtOdm09ipQ4Zjhi

Буду рада видеть вас снова! """

msg_marathon = f"""🎯 Не проспи 2025 год!

Ты ставишь цели, но не достигаешь?
⚡ С нашим марафоном ты сделаешь реальный прорыв!

📌 Чёткий план на год, мощная мотивация и поддержка.
🎥 Живые встречи + уроки в записи, а также встреча в Алматы.
💰 Стоимость участия — всего 10 000 тенге.

👉 Пиши "Хочу", чтобы записаться и начать новый год с побед!
"""