message_1 = f"""Здравствуйте!

Недавно вы проявили интерес к нашей игре Cashflow, и я хотела узнать, остались ли у вас вопросы или нужна дополнительная информация для того, чтобы записаться
Я уверена, что участие в игре поможет вам лучше понять, как управлять финансами и инвестировать с умом.

Напомню, что у нас есть несколько удобных временных слотов на выбор:

    Среда в 11:00
    Четверг в 19:00
    Суббота в 11:00

Если вы еще раздумываете, не стесняйтесь задать вопросы – я с удовольствием помогу вам сделать выбор!
Буду рада видеть вас среди наших участников"""


message_2 = f"""Здравствуйте. Вы интересовались игрой Cashflow, но к сожалению так и пришли

Если у вас в жизни застой? вы хотите улучшить семейные отношения или найти вторую половинку?
Вам не хватает денег и вы хотите вырасти в доходе? В вашей жизни много стресса и это негативно влияет на ваше здоровье?

Приходите на игру Кэшфлоу, потому что эта игра не только про финансы. Эта игра меняет мышление
Игроки, которые прошли нашу игру отмечают, что после игры в их жизни произошли преображения:

- начальник повысил зарплату
- муж стал внимательнее отноститься и дарить цветы
- жена стала ценить мужа
- стало больше энергии
- появилось время на важные дела
- появилось новое интересное окружение
- наконец-то поехали с семьей в отпуск
- совершили долгожданную покупку машины

Хотите также? Записывайтесь на игру. У нас есть несколько удобных временных слотов на выбор:

    Среда в 11:00
    Четверг в 19:00
    Суббота в 11:00
    
Не стесняйтесь задать вопросы – я с удовольствием помогу вам сделать выбор! Буду рада видеть вас среди наших участников"""

u_message_3 = f"""[Имя], спасибо, что были на нашей игре Cashflow!
🎉 Надеюсь, вам понравилось и вы получили ценные знания и навыки, которые пригодятся в реальной жизни.

Нам очень важно ваше мнение, чтобы мы могли сделать наши игры еще лучше и интереснее для всех участников. Буду очень признательна, если вы сможете уделить пару минут и заполнить короткую анкету обратной связи.
Вот ссылка на анкету: https://forms.gle/JCLtiTHxsNyPHB9TA
Ваши отзывы помогают нам расти и развиваться. Благодарю за ваше время и вклад в улучшение наших игр!
Если у вас остались какие-то вопросы или предложения, не стесняйтесь связаться со мной. Буду рада помочь!

С уважением, Ольга и клуб ProDvigenie"""

#номера из группы Ерлана

msg_tournament = f"""Здравствуйте. Приглашаю вас на турнир по Cashflow!
Турнир пройдет в три этапа. Три игры, которые определят самых сильных игроков. В первом туре сразятся 70 участников и до финала дойдут только 7 человек!
Каждый этап – это возможность не только проявить свои способности, но и научиться новому, обменяться опытом с другими участниками.
Вы можете принять участие как индивидуально, так и в составе команды.
Дата турнира: 15 сентября. Прием заявок открыт до 1 сентября.
Это будет грандиозное событие, и я уверена, что вам оно точно понравится! Готовы присоединиться?
Напишите "Турнир" в ответ и я отправлю вам анкету участника и положение по турниру"""

msg_t1 = f"""Сообщение для проверки работы скрипта
версия 0.12
отладка 7"""

msg_t2 = f"""Здравствуйте. Приглашаю на турнир по Cashflow!
70 участников и финал для 7 лучших.
Участвуйте, учитесь новому и обменивайтесь опытом.
Турнир 15 сентября, регистрация до 1 сентября.
Напишите "Турнир", чтобы получить анкету и все подробности!"""

phoneNumbers1 = [
    "+77019590660", "+77022950001", "+77023212792", "+77024117760", "+77026786000",
    "+77027061321", "+77027547774", "+77052063000", "+77052392020", "+77052500064",
    "+77053113161", "+77053322447", "+77054483621", "+77054669193", "+77054988404",
    "+77089430230", "+79992165289", "+77013533101"
]

phoneNumbers2 = [
    "+77004001820", "+77004625243", "+77007507125", "+77009523830", "+77010360080",
    "+77010701715", "+77011429148", "+77011606188", "+77012999963", "+77013868961",
    "+77014402444", "+77015262445", "+77015278070", "+77015483107", "+77054988404",
    "+77055320583", "+77055652940", "+77057717181"
]

phoneNumbers3 = [
    "+77057938447", "+77064140507", "+77070387001", "+77071200978", "+77071780405",
    "+77072082208", "+77072222449", "+77073437763", "+77073506685", "+77073664037",
    "+77073790913", "+77074301609", "+77074443031", "+77074868626", "+77075855000",
    "+77076362278", "+77077007721", "+77077020000"
]

phoneNumbers4 = [
    "+77769839206", "+77771758444", "+77771771917", "+77772219411", "+77772222786",
    "+77772376368", "+77773003415", "+77773397614", "+77774447767", "+77774743536",
    "+77775887222", "+77776117444", "+77776591789", "+77776954820", "+77778398855",
    "+77778918866", "+77779686868", "+77779764046", "+77071991721", "+77072046315",    
]

phoneNumbers5 = [
    "+77077214759", "+77077221284",
    "+77077771185", "+77078300828", "+77078346809", "+77078408040", "+77078509122",
    "+77078811448", "+77079211116", "+77079987784", "+77081981252", "+77082881368",
    "+77083076195", "+77083116552", "+77083883583", "+77084830410", "+77085347104",
]

phoneNumbers6 = [
    "+77085695619", "+77476099146", "+77476478292", "+77478461191", "+77478671838",
    "+77479622909", "+77479972535", "+77710057030", "+77712345609", "+77712925298",
    "+77717710666", "+77718567872", "+77751708888", "+77753964037", "+77754474527",
    "+77754780404", "+77756310043", "+77756718167", "+77758194449", "+77758590401",
    "+77759503262", "+77759673333", "+77760004504", "+77764674637", "+77765655555",
]

phoneNumbers7 = [
  "+77015552288", "+77015553840", "+77015554345", "+77015664899",
  "+77017155155", "+77017181838", "+77017418818", "+77017603854",
  "+77017619114", "+77017655511", "+77017773476", "+77017970410",
  "+77018725640", "+77019104676", "+77073596000", "+77086441460",
  "+77087547086", "+77087724459", "+77088000068", "+77088575736",
  "+77471110087", "+77472244696", "+77473441111", "+77473901345",
  "+77473937455", "+77474251959", "+77474542372", "+77475160456",
  "+77476067018", "+77476067018", "+77780870003", "+77783323060",
  "+77784063163", "+77784402030", "+77785070068", "+77785293526",
  "+77785454378", "+77787679252", "+77789018172", "+77789910544",
  "+79505181036", "+905010994926", "+998977517233"
];
