import pywhatkit
aq_numbers = ["+77017307763", "+77757967443", "+77002990331", "+77017526660"]
numbers = ["+77757468937", "+77474728450"]

""" numbers = [
  "+77086161603", "+77086121948", "+77086116735", "+77086113984", "+77086055676",
  "+77086043561", "+77086015168", "+77086008162", "+77085999123", "+77085999014",
  "+77085906559", "+77085905709", "+77085889515", "+77085874770", "+77085842667",
  "+77085805327", "+77085718850", "+77085687898", "+77085654156", "+77085652024",
  "+77085558989", "+77085534070", "+77085507038", "+77085501312", "+77085454253",
  "+77085420932", "+77085415250", "+77085328612", "+77085314902", "+77085275814",
  "+77085262043", "+77085210597", "+77085205297", "+77085160881", "+77085160814",
  "+77084948231", "+77084946731", "+77084859102", "+77084713162", "+77084678407",
  "+77084597710", "+77084400801", "+77084400120", "+77084250045", "+77084191578",
  "+77084166148", "+77083888540", "+77083880721", "+77083863507", "+77083831611",
  "+77083767987", "+77083706595", "+77083703408", "+77083695234", "+77083694830",
  "+77083653377", "+77083589636", "+77083279984", "+77083277927", "+77083272635",
  "+77083264052", "+77083107498", "+77083104326", "+77083039190", "+77082997858",
  "+77082981870", "+77082916691", "+77082898557", "+77082862731", "+77082855372",
  "+77082801528", "+77082782300", "+77082729445", "+77082701454", "+77082696796",
  "+77082637663", "+77082631160", "+77082604634", "+77082572994", "+77082562390",
  "+77082551009", "+77082511508", "+77082485762", "+77082420636", "+77082410907",
  "+77082389309", "+77082322146", "+77082223479", "+77082182012", "+77082170775",
  "+77082125663", "+77082086856", "+77082074336", "+77082001484", "+77081998778",
  "+77081962516", "+77081950779", "+77081941045", "+77081921903", "+77081888161"
] """


group_id = ''


message = f"""*Хочешь путешествовать, создавать авторские туры и при этом зарабатывать? 🌍✈️*
🎯Мечтаешь о жизни, где каждое путешествие приносит доход?
💰 Мы запускаем закрытый чат для тех, кто хочет не просто путешествовать, но и строить прибыльный бизнес на этом!

*Присоединяйся к нам, узнавай секреты заработка на путешествиях и открывай для себя новые горизонты. 🚀✨*
https://chat.whatsapp.com/BXfnpMNOHoW5vF8xg614eO
Перейди в чат прямо сейчас и начни свое путешествие к успеху! 🌟
Если ссылка неактивна напиши слово *ОК* в ответ на это смс"""


time_hour = 18
time_minute = 51
waiting_time_to_send = 15
close_tab = True
waiting_time_to_close = 4

mode = "contact"
for number in numbers:
    if pywhatkit.open_web():
        print("WhatsApp open")
        pywhatkit.sendwhatmsg_instantly(number, message, waiting_time_to_send, close_tab, waiting_time_to_close)
    else:
        print("Error code: 97654")
        print("Error Message: Please select a mode to send your message.")